app/controllers/categorias_controller.rb

SELECT * FROM `categorias`
SELECT * FROM `productos`
---
  def index
    @categorias = Categoria.all
    @productos = Producto.all

SELECT * FROM `categorias` WHERE (`categorias`.`id` = 1)
---
  def show
    @categoria = Categoria.find(params[:id])

INSERT INTO `categorias` (`updated_at`, `titulo`, `contenido`, `created_at`) VALUES('2011-06-29 16:11:54', 'Principal', 'Categoria Principal', '2011-06-29 16:11:54')
---
  def create
    @categoria = Categoria.new(params[:categoria])
    if @categoria.save