app/controllers/paginas_controller.rb

SELECT * FROM `paginas`
---
  def index
    @paginas = Pagina.all

SELECT * FROM `paginas` WHERE (`paginas`.`id` = 1)
---
  def show
    @pagina = Pagina.find(params[:id])

INSERT INTO `paginas` (`updated_at`, `titulo`, `contenido`, `created_at`) VALUES('2011-06-28 20:05:57', 'Acerca de', 'Acerca de nosotros dicen que somos asi no se por que pero lo somos mucho mas que eso :D', '2011-06-28 20:05:57')
---
  def create
    @pagina = Pagina.new(params[:pagina])
    if @pagina.save