app/controllers/productos_controller.rb

SELECT * FROM `productos`
---
  def index
    @productos = Producto.all

SELECT * FROM `productos` WHERE (`productos`.`id` = 1)
SELECT * FROM `categorias` WHERE (`categorias`.`id` = 1)
---
  def show
    @producto = Producto.find(params[:id])
    @categoria = Categoria.find(:all)

INSERT INTO `productos` (`categoria_id`, `updated_at`, `titulo`, `contenido`, `created_at`) VALUES(1, '2011-06-29 16:26:40', 'Cosas', 'Cosas para la vida si lo quiere lo tiene :D', '2011-06-29 16:26:40')
---
  def create
    @producto = Producto.new(params[:producto])
    if @producto.save

SELECT * FROM `productos` WHERE (`productos`.`id` = 2)
---
  def edit
    @producto = Producto.find(params[:id])

SELECT * FROM `productos` WHERE (`productos`.`id` = 2)
UPDATE `productos` SET `categoria_id` = 2, `updated_at` = '2011-06-29 16:37:23' WHERE `id` = 2
---
  def update
    @producto = Producto.find(params[:id])
    if @producto.update_attributes(params[:producto])